import pandas as pd

data = {
    'Антон': [4, 5, 5, 5, 4],
    'Даша': [4, 5, 3, 4, 4],
    'Лена': [5, 5, 5, 5, 5],
    'Александр': [4, 4, 4, 4, 4],
    'Андрей': [2, 3, 4, 3, 3],
    'Илья': [3, 3, 4, 3, 5],
    'Мишa': [5, 4, 5, 4, 3],
    'Янa': [3, 3, 3, 4, 5],
    'Аннa': [5, 4, 5, 3, 4],
    'Петя': [3, 4, 4, 5, 2]
}

subjects = ['Математика', 'Физика', 'Лит-ра', 'Английский', 'История']

df = pd.DataFrame(data, index=subjects)

print("Первые 5 строк таблицы:")
print(df.head())


# Средняя оценка по каждому предмету
average_scores = df.mean(axis=1)
print("\nСредняя оценка по каждому предмету:")
print(average_scores)

# Медианная оценка по каждому предмету
median_scores = df.median(axis=1)
print("\nМедианная оценка по каждому предмету:")
print(median_scores)

# Q1 и Q3 для оценок по математике
Q1_math = df.loc['Математика'].quantile(0.25)
Q3_math = df.loc['Математика'].quantile(0.75)
print("\nQ1 и Q3 для оценок по математике:")
print(f"Q1 (25-й): {Q1_math}")
print(f"Q3 (75-й): {Q3_math}")

# Вычисляем IQR (межквартильный размах) для оценок по математике
IQR_math = Q3_math - Q1_math
print(f"\nIQR (межквартильный размах) для оценок по математике: {IQR_math}")

# Вычисляем стандартное отклонение для оценок по каждому предмету
std_dev = df.std(axis=1)
print("\nСтандартное отклонение по каждому предмету:")
print(std_dev)

